InformationRegisters/УсловияОферт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияОферт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеУсловий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОферты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфертПоОблигациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбъявления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоДляФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КупонныйДоходПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КупонныйДоходПоОблигациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВРублях</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаОпределена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоминалыЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НоминалыЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроцентОтНачальногоНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияНастроекУчетаЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекУчетаЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОфертПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОфертПоОблигациям</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОфертаПокупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОфертаПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Досрочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопОферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОфертаПокупкаОпцион</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КатегорииОблигаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Государственная</Name>
					<Comment>Государственная краткосрочная облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субфедеральная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корпоративная</Name>
					<Comment>Корпоративная</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еврооблигация</Name>
					<Comment>Еврооблигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Муниципальная</Name>
					<Comment>Облигация субъекта РФ, муниципальная облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ипотечная</Name>
					<Comment>Ипотечная</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УправляющиеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>УправляющиеКомпании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Кэширование/Ext/Module.bsl
Функция ОпределитьНастройкуУчета(Период, Организация, СчетДоверительногоУправления, ИмяНастройки) Экспорт
	// Расчетные настройки
	ЗначениеНастройки = Неопределено;
	Если БухгалтерскийУчет.ОпределитьРасчетнуюНастройкуУчета(Период, Организация, СчетДоверительногоУправления, ИмяНастройки, ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;       
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаОбщиеСрезПоследних." + ИмяНастройки + "
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних";
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка[ИмяНастройки];
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ОпределитьНастройкуУчета

Функция ПолучитьДатуИЦенуВыкупа(Облигация, Дата, ДатаПокупки, СчетДоверительногоУправления, ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, ИгнорироватьИнформациюОбОбязательномДосрочномПогашении, ОтборПоТипамОфертПоОблигациям, ДелатьОтборПоДатеОбъявления) Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
		|	УсловияОферт.Цена КАК Цена
		|ПОМЕСТИТЬ _Оферты
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.Облигация = &Облигация
		|	И УсловияОферт.ДатаВыкупа >= &Дата
		|	И &ОтборПоДатеОбъявления 
		|	И &ОтборПоТипамОфертПоОблигациям 
		|	И &УчитыватьОбъявлениеОбязательногоДосрочногоПогашения
		|	И НЕ УсловияОферт.ТолькоДляФизическихЛиц
		|	И (&ДатаПокупки = НЕОПРЕДЕЛЕНО
		|			ИЛИ УсловияОферт.АкцептПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ УсловияОферт.АкцептПо > &ДатаПокупки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыкупа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Оферты.Цена КАК Цена,
		|	ЕСТЬNULL(КупонныйДоходПоОблигациям.ДатаОкончанияКупона, Оферты.ДатаВыкупа) КАК ДатаВыкупа
		|ИЗ
		|	_Оферты КАК Оферты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ПО Оферты.ДатаВыкупа >= КупонныйДоходПоОблигациям.ДатаОкончанияКупона
		|			И (КупонныйДоходПоОблигациям.Облигация = &Облигация)
		|			И (&ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона УБЫВ");
	
	
	Если СчетДоверительногоУправления = Неопределено Тогда
		ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона = Ложь;
		УчитыватьОбъявлениеОбязательногоДосрочногоПогашения = Истина;
	Иначе
		
		Если ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона = Неопределено Тогда
		
			ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона =
				БухгалтерскийУчет.ОпределитьНастройкуУчета(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона");
				
		КонецЕсли;
		
		Если ИгнорироватьИнформациюОбОбязательномДосрочномПогашении = Неопределено Тогда
		
			ИгнорироватьИнформациюОбОбязательномДосрочномПогашении = 
				БухгалтерскийУчет.ОпределитьНастройкуУчета(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ИгнорироватьИнформациюОбОбязательномДосрочномПогашении");
			
		КонецЕсли;
		
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_431") Тогда
			
			Если Дата >= '20230501' И БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(СчетДоверительногоУправления, Дата) Тогда // #483764 с 1.5.23 группа будущее настройкой начинает игнорировать инфу об обяз.доср.погаш. а по этй бумаге не игнорит
			
				ИгнорироватьИнформациюОбОбязательномДосрочномПогашении = Ложь;
				
			Иначе
				
				МассивСчетовСАФМАР = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
					ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"),
					ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
					Дата);
			
				ЭтоКлиентСАФМАР = (МассивСчетовСАФМАР.Найти(СчетДоверительногоУправления) <> Неопределено);
				
				Если ЭтоКлиентСАФМАР Тогда
					ИгнорироватьИнформациюОбОбязательномДосрочномПогашении = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_011") И Дата >= '20230101' Тогда // ГТЛК АО, 4B02-11-32432-H-001P, 1000.00 USD
			
			// #465403 #Хардкод #Техдолг
			
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СафмарПН") Тогда // НПФ Достойное БУДУЩЕЕ  АО ПН
				ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона = Ложь;
			КонецЕсли;
			
		КонецЕсли;		
		
		Если НЕ ИгнорироватьИнформациюОбОбязательномДосрочномПогашении Тогда
			УчитыватьОбъявлениеОбязательногоДосрочногоПогашения = Истина;
		Иначе // игнорируем объявление досрочного погашения до самого дня погашения
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УчитыватьОбъявлениеОбязательногоДосрочногоПогашения",
				"(УсловияОферт.ТипОферты <> ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно) ИЛИ УсловияОферт.ДатаВыкупа = НАЧАЛОПЕРИОДА(&Дата, День))");
		КонецЕсли;
			
	КонецЕсли;	
	
	ОтборПоДатеОбъявления = "(УсловияОферт.ДатаОбъявления = ДАТАВРЕМЯ(1, 1, 1) ИЛИ УсловияОферт.ДатаОбъявления <= &Дата)";
	Если НЕ ДелатьОтборПоДатеОбъявления ИЛИ Облигация.ДатаПогашения = '00010101' Тогда // для бессрочной бумаги оферты берем без учета объявления (#362218, #380983)
		ОтборПоДатеОбъявления = "ИСТИНА";
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеОбъявления", ОтборПоДатеОбъявления);
	
	Если ЗначениеЗаполнено(ОтборПоТипамОфертПоОблигациям) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоТипамОфертПоОблигациям", "УсловияОферт.ТипОферты В(&ОтборПоТипамОфертПоОблигациям)");
		
		МассивОтборПоТипамОфертПоОблигациям = Новый Массив;
		
		Если ТипЗнч(ОтборПоТипамОфертПоОблигациям) = Тип("Структура") Тогда
			Для Каждого ЗначениеОтборПоТипамОфертПоОблигациям Из ОтборПоТипамОфертПоОблигациям Цикл
				Если ИгнорироватьИнформациюОбОбязательномДосрочномПогашении И ЗначениеОтборПоТипамОфертПоОблигациям.Значение = Перечисления.ТипыОфертПоОблигациям.Досрочно Тогда
					Продолжить;	
				Иначе	
					МассивОтборПоТипамОфертПоОблигациям.Добавить(ЗначениеОтборПоТипамОфертПоОблигациям.Значение);
				КонецЕсли;	
			КонецЦикла;	
		ИначеЕсли ТипЗнч(ОтборПоТипамОфертПоОблигациям) = Тип("ПеречислениеСсылка.ТипыОфертПоОблигациям") Тогда	
			Если ИгнорироватьИнформациюОбОбязательномДосрочномПогашении И ОтборПоТипамОфертПоОблигациям <> Перечисления.ТипыОфертПоОблигациям.Досрочно Тогда
				МассивОтборПоТипамОфертПоОблигациям.Добавить(ОтборПоТипамОфертПоОблигациям);	
			КонецЕсли;	
		КонецЕсли;	
			
		Запрос.УстановитьПараметр("ОтборПоТипамОфертПоОблигациям", 								МассивОтборПоТипамОфертПоОблигациям);
	Иначе
		Запрос.УстановитьПараметр("ОтборПоТипамОфертПоОблигациям", 								Истина);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Облигация",													Облигация);
	Запрос.УстановитьПараметр("Дата",														Дата);
	Запрос.УстановитьПараметр("ДатаПокупки",												ДатаПокупки);
	Запрос.УстановитьПараметр("ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона", ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона);
	Запрос.УстановитьПараметр("УчитыватьОбъявлениеОбязательногоДосрочногоПогашения", 		УчитыватьОбъявлениеОбязательногоДосрочногоПогашения);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ДатаВыкупа	= ВыборкаДетальныеЗаписи.ДатаВыкупа;
		ЦенаВыкупа	= ВыборкаДетальныеЗаписи.Цена;
		
	Иначе
		
		РеквизитыОблигации	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Облигация, "ДатаПогашения, ИндексируемыйНоминал, Амортизационная");
		ДатаВыкупа			= ?(ЗначениеЗаполнено(РеквизитыОблигации.ДатаПогашения), РеквизитыОблигации.ДатаПогашения, Неопределено);
		
		Если РеквизитыОблигации.ИндексируемыйНоминал И (ДатаВыкупа = Неопределено ИЛИ ДатаВыкупа > Дата)
			ИЛИ РеквизитыОблигации.Амортизационная И ДатаВыкупа = Неопределено
		Тогда 
			ЦенаВыкупа = Неопределено;
		Иначе
			ЦенаВыкупа = Справочники.Облигации.ПолучитьНоминал(Облигация, ДатаВыкупа);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ДатаВыкупа, ЦенаВыкупа", ДатаВыкупа, ЦенаВыкупа); 
	
КонецФункции

Функция СчетаДоверительногоУправленияКлиента(Клиент, Организация, Период) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
		|			И (СчетаДоверительногоУправления.Организация = &Организация)
		|			И (НЕ СчетаДоверительногоУправления.ПометкаУдаления)
		|			И (СчетаДоверительногоУправления.ДатаЗаключения <= &Период)
		|			И (СчетаДоверительногоУправления.ДатаРасторжения > &Период
		|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент");
	
	Запрос.УстановитьПараметр("Период",		 Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Клиент",		 Клиент);
			
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеАктивыЕПС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ВекселяДоПогашения))");
			
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

Функция ВидЗадолженностиСвязанСПартиями(ВидЗадолженности) Экспорт

	МассивВидовЗадолженностиСвязанныхСПартиями = Новый Массив;
	
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
	
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюВекселя);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюКупона);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюОблигации);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюПая);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода);
	
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоСделке);
	МассивВидовЗадолженностиСвязанныхСПартиями.Добавить(Справочники.ВидыЗадолженности.ПоФорвардуПоставки);
	
	Возврат (МассивВидовЗадолженностиСвязанныхСПартиями.Найти(ВидЗадолженности) <> Неопределено);

КонецФункции

Функция ПолучитьПереопределенныеУчетныеАктивыЦБРФ(Период, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ИЗ
		|	РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(
		|			&Период,
		|			(Организация, Клиент) В
		|				(ВЫБРАТЬ
		|					_Клиент.Организация,
		|					_Клиент.Клиент
		|				ИЗ
		|					_Клиент)) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних");
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	ПереопределенныеУчетныеАктивыЦБРФ = Запрос.Выполнить().Выгрузить();
	ПереопределенныеУчетныеАктивыЦБРФ.Индексы.Добавить("Эмитент, ИсходныйУчетныйАктивЦБ");
	
	Возврат ПереопределенныеУчетныеАктивыЦБРФ;

КонецФункции

Функция ПолучитьПереопределенныйУчетныйАктивЦБРФ(УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Эмитент)

	Если СчетДоверительногоУправления = Неопределено Тогда
		Возврат УчетныйАктивЦБРФ;
	КонецЕсли;
	
	Если Период = '00010101' ИЛИ Период = Неопределено Тогда  
		ДатаНастроек = Период;
	ИначеЕсли ТипЗнч(Период) = Тип("Дата") ИЛИ ТипЗнч(Период) = Тип("Граница") Тогда
		ДатаНастроек = КонецДня(СистемныеФункции.ПолучитьДатуИзГраницы(Период));
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип значения '%1' параметра 'Период'", ТипЗнч(Период));
	КонецЕсли;	
	
	ПереопределенныеУчетныеАктивыЦБРФ	= Кэширование.ПолучитьПереопределенныеУчетныеАктивыЦБРФ(ДатаНастроек, СчетДоверительногоУправления);
	ПереопределенныйУчетныйАктивЦБРФ	= ПереопределенныеУчетныеАктивыЦБРФ.НайтиСтроки(Новый Структура("Эмитент, ИсходныйУчетныйАктивЦБ", Эмитент, УчетныйАктивЦБРФ));
	УчетныйАктивЦБ						= ?(ПереопределенныйУчетныйАктивЦБРФ.Количество() = 0, УчетныйАктивЦБРФ, ПереопределенныйУчетныйАктивЦБРФ[0].НовыйУчетныйАктивЦБ);
	
	Возврат УчетныйАктивЦБ;

КонецФункции

Функция ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период)

	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции ИЛИ Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		Если СчетДоверительногоУправления = Неопределено Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой;
		Иначе
			Настройка = БухгалтерскийУчет.ОпределитьНастройкуУчета(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ПриоритетнаяКатегорияПриКлассификацииДолевыхЦенныхБумаг");
			Если НЕ ЗначениеЗаполнено(Настройка) Тогда
				Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой;
			Иначе	
				Возврат Настройка;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		Если СчетДоверительногоУправления = Неопределено Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток;
		Иначе
			Настройка = БухгалтерскийУчет.ОпределитьНастройкуУчета(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ПриоритетнаяКатегорияПриКлассификацииДолговыхЦенныхБумаг");
			Если НЕ ЗначениеЗаполнено(Настройка) Тогда
				Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток;
			Иначе	
				Возврат Настройка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ОпределитьУчетныйАктивЕПС(Период, Рынок, Актив, СчетДоверительногоУправления = Неопределено) Экспорт

	Эмитент = Неопределено;
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		
		АктивУчетныйАктивЦБРФ = ПолучитьПереопределенныйУчетныйАктивЦБРФ(Актив.УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Актив.Эмитент);
		
		ПриоритетнаяКатегория = ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период);
		
		Если ПриоритетнаяКатегория = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи Тогда
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиКредитныхОрганизаций;
				
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ Тогда
				
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;
				
			Иначе //незаполнено или что- то непонятное
				
				Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиКредитныхОрганизаций;
				КонецЕсли;
				
			КонецЕсли;
		Иначе			
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
				
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ Тогда
				
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
				
			Иначе //незаполнено или что- то непонятное
				
				Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		//пока отправим на "посправедливой"
		
		// для паев нет возможности получать данные из <<УчетныйАктивЦБРФ>>
		УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(Период, Актив);
		УправляющаяКомпания_ЮрЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(УправляющаяКомпания_ЮрЛицо, "Банки") = Неопределено Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
		КонецЕсли;
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда
		// К.Б.:  ДР классифицируются по базовому активу
		УчетныйАктивЦБРФ =  ОпределитьУчетныйАктивЕПС(Период, Перечисления.РынкиЦенныхБумаг.Акции, Актив.БазоваяЦБ, СчетДоверительногоУправления);
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		// а Х.З.
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		
		Если Актив.Эмитент.ЮрФизЛицо = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МинфинРоссии") Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияРФ;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма КАК ОрганизационноПравоваяФорма,
				|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации КАК СтранаРегистрации
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
				|			&Период,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
				
			Запрос.УстановитьПараметр("Период",    Период);
			Запрос.УстановитьПараметр("ЮрФизЛицо", Актив.Эмитент.ЮрФизЛицо);
			
			ОПФ = Справочники.ОрганизационноПравовыеФормы.ПубличноеАкционерноеОбщество; // по умолчанию некое юр.лицо
			Страна = Справочники.СтраныМира.Россия;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОПФ = Выборка.ОрганизационноПравоваяФорма;
				Страна = Выборка.СтранаРегистрации;
			КонецЕсли;
			КредитнаяОрганизация = (Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") <> Неопределено);
			
			Если Страна = Справочники.СтраныМира.Россия Тогда
				Если ОПФ = Справочники.ОрганизационноПравовыеФормы.ГосударственноеПредприятие Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияСубъектовРФ;	
				ИначеЕсли КредитнаяОрганизация Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияКредитныхОрганизаций;
				Иначе
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияПрочихРезидентов;
				КонецЕсли;
			Иначе
				Если ОПФ = Справочники.ОрганизационноПравовыеФормы.ГосударственноеПредприятие Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияИностранныхГосударств;	
				ИначеЕсли КредитнаяОрганизация Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияБанковНерезидентов;
				Иначе
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияПрочихНерезидентов;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// пока на долговые по амортизации
		Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДПрочихРезидентов;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДКредитныхОрганизаций;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		
		АктивУчетныйАктивЦБРФ = ПолучитьПереопределенныйУчетныйАктивЦБРФ(Актив.УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Актив.Эмитент);
		
		ПриоритетнаяКатегория = ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период);
		
		Если ПриоритетнаяКатегория = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов;
			Иначе
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
						  ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокСубъектовРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокКредитныхОрганизаций;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихРезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокБанковНерезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихНерезидентов;
			Иначе
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокРФ;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
						  ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокСубъектовРФ;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокКредитныхОрганизаций;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихНерезидентов;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокБанковНерезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихРезидентов;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
		
		// #ТехническийДолг - 28/10/17 - если никто не возвражает, так буду помечать те вещи, которые потом нужно будет переделать
		
		// АД!!!!
		НаименованиеАктива = Лев(Актив.Наименование, СтрНайти(Актив.Наименование, "-") - 1);
		
		Индексы = "RTS,MXI,MIX,RVI";
		Акции = "SBRF,GAZR,LKOH,VTBR,SBPR,MGNT,ROSN,HYDR,GMKR,SNGP,FEES,ALRS,MOEX,SNGR,RTKM,NLMK,AFLT,TATN,CHMF,NOTK,MTSI,TRNF";
		Облигации = "OF10,OFZ4,OFZ2,OF15,OFZ6";
		Валюта = "Si,ED,Eu,UJPY,GBPU,AUDU,UCAD,UCHF";
		ПроцентныеСтавки = "RUON";
		ТоварныеКонтракты = "BR,GOLD,SILV,PLT,PLD";
		
		Если СтрНайти(Индексы, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаДолевыхИнструментах;
		ИначеЕсли СтрНайти(Акции, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаДолевыхИнструментах;
		ИначеЕсли СтрНайти(Облигации, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
		ИначеЕсли СтрНайти(Валюта, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаВалютныхДоговорах;
		ИначеЕсли СтрНайти(ПроцентныеСтавки, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПрочихДоговорах;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		
		УчетныйАктивЦБРФ = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(Актив, Период);
		
	КонецЕсли;
	
	Возврат УчетныйАктивЦБРФ;
	
КонецФункции

Функция ОбъявленаОбязательнаяДосрочнаяОферта(Облигация, Дата) Экспорт

	ПараметрыОферты = Новый Структура("Объявлена,ДатаВыкупа,Цена", Ложь, '00010101', 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(УсловияОферт.ДатаВыкупа) КАК ДатаВыкупа
		|ПОМЕСТИТЬ _ДатаДосрочнойОферты
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.Облигация = &Облигация
		|	И УсловияОферт.ДатаОбъявления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И УсловияОферт.ДатаОбъявления <= &ДатаОбъявления
		|	И УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Объявлена,
		|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
		|	УсловияОферт.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.Облигация = &Облигация
		|	И УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно)
		|	И УсловияОферт.ДатаВыкупа В
		|			(ВЫБРАТЬ
		|				_ДатаДосрочнойОферты.ДатаВыкупа
		|			ИЗ
		|				_ДатаДосрочнойОферты)";
	
	Запрос.УстановитьПараметр("ДатаОбъявления", Дата);
	Запрос.УстановитьПараметр("Облигация", Облигация);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОферты, ВыборкаДетальныеЗаписи);
	КонецЕсли;

	Возврат ПараметрыОферты;
	
КонецФункции

Функция ПолучитьНоминал(Облигация, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумагСрезПоследних.Номинал
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Дата, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Номинал;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция КлиентДоверительногоУправления(СчетДоверительногоУправления, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Клиент
	КонецЕсли;
	
КонецФункции // КлиентДоверительногоУправления

Функция РеквизитыСчетаДоверительногоУправления(СчетДоверительногоУправления) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетДоверительногоУправления, "ДатаРасторжения");
	
КонецФункции

// Возвращает массив клиентов, входящих в группу Будущее
Функция КлиентыГруппыБудущее() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_УГМК"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФОПФ"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ТелекомСоюз")); 
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой"));
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Федерация"));
	
	Возврат Результат;
		
КонецФункции

Функция КоличествоЗаписейТаблицы(ПолноеИмяТаблицы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	#ПолноеИмяТаблицы# КАК Таблица");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяТаблицы#", ПолноеИмяТаблицы);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	КоличествоЗаписей = ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Количество, 0);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КоличествоЗаписей;
	
КонецФункции

Функция ПолучитьДатуПредыдущегоДействия(ВидДействия, СчетДоверительногоУправления, Дата, ОтсутствуютНастройки) Экспорт

	Вчера = НачалоДня(Дата)-1;
	
	МассивСДатой = Справочники.НастройкиРегламентныхДействий.ПолучитьДатыДействияЗаПериод(ВидДействия, СчетДоверительногоУправления, НачалоГода(НачалоГода(Дата)-1), Вчера, Дата, Истина, ОтсутствуютНастройки);
	
	Если ОтсутствуютНастройки Тогда 
		Возврат Неопределено;
	ИначеЕсли МассивСДатой.Количество() = 1 Тогда
		Возврат МассивСДатой[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГФУ_РасходовСделкамСВалютой(Валюта) Экспорт

	Если Валюта.Код = "840" Тогда // USD
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47101");
	ИначеЕсли Валюта.Код = "978" Тогда // EUR
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47102");
	ИначеЕсли Валюта.Код = "826" Тогда // GBP
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47103");
	ИначеЕсли Валюта.Код = "756" Тогда // CHF
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47104");
	ИначеЕсли Валюта.Код = "392" Тогда // JPY
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47105");
	Иначе
		ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47106");
	КонецЕсли;
	
	Возврат ГФУ;
	
КонецФункции

Функция ОпределитьНастройкиУчетаЦенныхБумаг(Период, Организация, СчетДоверительногоУправления, ИмяМетода) Экспорт

	Если ИмяМетода = "ПолучитьСписокНастроекДляРасчета" Тогда
		СписокНастроек = ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ПолучитьСписокНастроекДляРасчета();
	ИначеЕсли ИмяМетода = "ПолучитьСписокНастроекДляПереоценки" Тогда
		СписокНастроек = ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ПолучитьСписокНастроекДляПереоценки();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Рынок КАК Рынок,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Настройка КАК Настройка,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки КАК ЗначениеНастройки,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Настройка.ИмяПредопределенныхДанных КАК Имя,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Партия КАК Партия,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.СтрокаПартии КАК СтрокаПартии
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Настройка В (&Настройки)) КАК ЗначенияНастроекУчетаЦенныхБумагСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Клиент КАК _Клиент
		|		ПО ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Клиент = _Клиент.Клиент
		|ГДЕ
		|	НЕ ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Отключить";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Если СписокНастроек = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Настройка В (&Настройки)", "");
	Иначе
		Запрос.УстановитьПараметр("Настройки", СписокНастроек);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьОблигацииРеклассифицированныеНа504ПриПереходеНаМСФО9(СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеклассификацияАктивовЕПС.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	Документ.РеклассификацияАктивовЕПС КАК РеклассификацияАктивовЕПС
		|ГДЕ
		|	РеклассификацияАктивовЕПС.Дата = ДАТАВРЕМЯ(2025, 1, 1)
		|	И РеклассификацияАктивовЕПС.Проведен
		|	И РеклассификацияАктивовЕПС.Организация = &Организация
		|	И РеклассификацияАктивовЕПС.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РеклассификацияАктивовЕПС.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения)
		|	И РеклассификацияАктивовЕПС.УчетныйАктивЕПССтарый.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток))";
	
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")); // для группы будущее же, значит Траст
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага");

КонецФункции

Функция ПолучитьПартииНепроведенныхРекласовОтКоторыхОтказались() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРегистров.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _Корректировки
		|ИЗ
		|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|ГДЕ
		|	КорректировкаРегистров.Дата = ДАТАВРЕМЯ(2025, 7, 31, 23, 59, 59)
		|	И КорректировкаРегистров.Организация = &Организация
		|	И КорректировкаРегистров.Комментарий ПОДОБНО ""Убираем непроведенные реклассы""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагСписание.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагСписание.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагСписание.Партия КАК ПартияСписания,
		|	БухПартииЦенныхБумагСписание.СтрокаПартии КАК СтрокаПартииСписание,
		|	БухПартииЦенныхБумагЗачисление.Партия КАК ПартияЗачисление,
		|	БухПартииЦенныхБумагЗачисление.СтрокаПартии КАК СтрокаПартииЗачисление
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумагСписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумагЗачисление
		|		ПО (БухПартииЦенныхБумагЗачисление.Регистратор В
		|				(ВЫБРАТЬ
		|					_Корректировки.Ссылка
		|				ИЗ
		|					_Корректировки))
		|			И (БухПартииЦенныхБумагСписание.Регистратор В
		|				(ВЫБРАТЬ
		|					_Корректировки.Ссылка
		|				ИЗ
		|					_Корректировки))
		|			И (БухПартииЦенныхБумагЗачисление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (БухПартииЦенныхБумагСписание.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (БухПартииЦенныхБумагЗачисление.Количество = БухПартииЦенныхБумагСписание.Количество)
		|			И (БухПартииЦенныхБумагЗачисление.Стоимость = БухПартииЦенныхБумагСписание.Стоимость)
		|			И (БухПартииЦенныхБумагЗачисление.ДисконтПремияНачисленный = БухПартииЦенныхБумагСписание.ДисконтПремияНачисленный)
		|			И (БухПартииЦенныхБумагЗачисление.КорректировкаЭСП = БухПартииЦенныхБумагСписание.КорректировкаЭСП)";
	
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
